src/Catalogs/УП_Портфели.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>УП_Портфели</Name>
			<Comment>Произвольный набор активов пользователя</Comment>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<TabularSection>
				<Properties>
					<Name>Состав</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Инструмент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.УП_БиржевыеИнструменты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/CommonForms/УП_ЗагрузчикПортфеля/Ext/Form/Module.bsl
// Модуль формы обработки загрузки CSV

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// Заполним список существующих портфелей
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	УП_Портфели.Ссылка КАК Ссылка,
		|	УП_Портфели.Наименование КАК Наименование
		|ИЗ
		|	Справочник.УП_Портфели КАК УП_Портфели
		|ГДЕ
		|	НЕ УП_Портфели.ПометкаУдаления
		|
		|УПОРЯДОЧИТЬ ПО
		|	Наименование";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Элементы.Портфель.СписокВыбора.Добавить(Выборка.Ссылка, Выборка.Наименование);
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ВыбратьФайл(Команда)
	
	ДиалогВыбораФайла = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	ДиалогВыбораФайла.Заголовок = "Выберите файл CSV с портфелем";
	ДиалогВыбораФайла.МножественныйВыбор = Ложь;
	ДиалогВыбораФайла.Фильтр = "Файлы CSV (*.csv)|*.csv|Все файлы (*.*)|*.*";
	
	Если ДиалогВыбораФайла.Выбрать() Тогда
		ИмяФайла = ДиалогВыбораФайла.ПолноеИмяФайла;
		
		// Загрузим файл во временное хранилище
		НачатьПомещениеФайла(Новый ОписаниеОповещения("ПослеПомещенияФайла", ЭтаФорма), 
			АдресФайлаВХранилище, ИмяФайла, Ложь);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеПомещенияФайла(Результат, АдресВременногоХранилища, ВыбранноеИмяФайла, ДополнительныеПараметры) Экспорт
	
	Если Результат Тогда
		АдресФайлаВХранилище = АдресВременногоХранилища;
		ИмяФайла = ВыбранноеИмяФайла;
		
		// Прочитаем и покажем данные
		ПрочитатьДанныеИзФайла();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПрочитатьДанныеИзФайла()
	
	Если Не ЗначениеЗаполнено(АдресФайлаВХранилище) Тогда
		Возврат;
	КонецЕсли;
	
	// Получим двоичные данные
	ДвоичныеДанные = ПолучитьИзВременногоХранилища(АдресФайлаВХранилище);
	
	// Прочитаем как текст
	ЧтениеТекста = Новый ЧтениеТекста();
	ЧтениеТекста.ОткрытьПоток(ДвоичныеДанные.ОткрытьПотокДляЧтения(), КодировкаТекста.UTF8);
	
	// Очистим таблицу
	ТаблицаДанных.Очистить();
	
	НомерСтроки = 0;
	Пока Истина Цикл
		СтрокаТекста = ЧтениеТекста.ПрочитатьСтроку();
		
		Если СтрокаТекста = Неопределено Тогда
			Прервать;
		КонецЕсли;
		
		НомерСтроки = НомерСтроки + 1;
		
		// Пропустим заголовок
		Если НомерСтроки = 1 Тогда
			Продолжить;
		КонецЕсли;
		
		// Разберем строку
		МассивДанных = СтрРазделить(СтрокаТекста, ";", Ложь);
		
		Если МассивДанных.Количество() >= 3 Тогда
			НоваяСтрока = ТаблицаДанных.Добавить();
			НоваяСтрока.Наименование = СокрЛП(МассивДанных[0]);
			НоваяСтрока.Тикер = СокрЛП(МассивДанных[1]);
			
			Попытка
				НоваяСтрока.Количество = Число(СокрЛП(МассивДанных[2]));
			Исключение
				НоваяСтрока.Количество = 0;
			КонецПопытки;
			
			// Попробуем найти инструмент
			НоваяСтрока.Инструмент = Справочники.УП_БиржевыеИнструменты.НайтиПоКоду(НоваяСтрока.Тикер);
			
			Если НЕ ЗначениеЗаполнено(НоваяСтрока.Инструмент) Тогда
				НоваяСтрока.Статус = "Инструмент не найден";
			Иначе
				НоваяСтрока.Статус = "OK";
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	ЧтениеТекста.Закрыть();
	
	// Обновим информацию
	ВсегоСтрок = ТаблицаДанных.Количество();
	НайденоИнструментов = 0;
	
	Для Каждого Строка Из ТаблицаДанных Цикл
		Если ЗначениеЗаполнено(Строка.Инструмент) Тогда
			НайденоИнструментов = НайденоИнструментов + 1;
		КонецЕсли;
	КонецЦикла;
	
	ТекстИнформации = СтрШаблон("Загружено строк: %1. Найдено инструментов: %2", 
		ВсегоСтрок, НайденоИнструментов);
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьНовыйПортфель(Команда)
	
	НовыйПортфель = ВвестиСтроку(, "Введите наименование нового портфеля");
	
	Если ЗначениеЗаполнено(НовыйПортфель) Тогда
		СоздатьНовыйПортфельНаСервере(НовыйПортфель);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура СоздатьНовыйПортфельНаСервере(Наименование)
	
	НовыйЭлемент = Справочники.УП_Портфели.СоздатьЭлемент();
	НовыйЭлемент.Наименование = Наименование;
	НовыйЭлемент.Записать();
	
	Портфель = НовыйЭлемент.Ссылка;
	
	// Обновим список выбора
	Элементы.Портфель.СписокВыбора.Добавить(Портфель, Наименование);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьВПортфель(Команда)
	
	Если НЕ ЗначениеЗаполнено(Портфель) Тогда
		ПоказатьПредупреждение(, "Выберите портфель для загрузки!");
		Возврат;
	КонецЕсли;
	
	Если ТаблицаДанных.Количество() = 0 Тогда
		ПоказатьПредупреждение(, "Нет данных для загрузки!");
		Возврат;
	КонецЕсли;
	
	// Проверим, что все инструменты найдены
	ЕстьНенайденные = Ложь;
	Для Каждого Строка Из ТаблицаДанных Цикл
		Если НЕ ЗначениеЗаполнено(Строка.Инструмент) Тогда
			ЕстьНенайденные = Истина;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Если ЕстьНенайденные Тогда
		Ответ = Вопрос("В файле есть инструменты, которые не найдены в справочнике. " +
			"Создать их автоматически?", РежимДиалогаВопрос.ДаНетОтмена);
		
		Если Ответ = КодВозвратаДиалога.Да Тогда
			СоздатьНедостающиеИнструменты();
		ИначеЕсли Ответ = КодВозвратаДиалога.Отмена Тогда
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
	// Загружаем
	Если ЗагрузитьДанныеВПортфель() Тогда
		ПоказатьОповещениеПользователя("Загрузка завершена", , 
			"Данные успешно загружены в портфель");
		Закрыть();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура СоздатьНедостающиеИнструменты()
	
	Для Каждого Строка Из ТаблицаДанных Цикл
		Если НЕ ЗначениеЗаполнено(Строка.Инструмент) И ЗначениеЗаполнено(Строка.Тикер) Тогда
			
			НовыйИнструмент = Справочники.УП_БиржевыеИнструменты.СоздатьЭлемент();
			НовыйИнструмент.Код = Строка.Тикер;
			НовыйИнструмент.Наименование = Строка.Наименование;
			
			Попытка
				НовыйИнструмент.Записать();
				Строка.Инструмент = НовыйИнструмент.Ссылка;
				Строка.Статус = "Создан";
			Исключение
				Строка.Статус = "Ошибка создания: " + ОписаниеОшибки();
			КонецПопытки;
			
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Функция ЗагрузитьДанныеВПортфель()
	
	Попытка
		ОбъектПортфеля = Портфель.ПолучитьОбъект();
		
		Если РежимЗагрузки = "Заменить" Тогда
			ОбъектПортфеля.Состав.Очистить();
		КонецЕсли;
		
		Для Каждого СтрокаДанных Из ТаблицаДанных Цикл
			Если ЗначениеЗаполнено(СтрокаДанных.Инструмент) И СтрокаДанных.Количество > 0 Тогда
				
				// Проверим, есть ли уже такой инструмент
				НайденнаяСтрока = Неопределено;
				Если РежимЗагрузки = "Дополнить" Тогда
					НайденнаяСтрока = ОбъектПортфеля.Состав.Найти(СтрокаДанных.Инструмент, "Инструмент");
				КонецЕсли;
				
				Если НайденнаяСтрока = Неопределено Тогда
					НоваяСтрока = ОбъектПортфеля.Состав.Добавить();
					НоваяСтрока.Инструмент = СтрокаДанных.Инструмент;
					НоваяСтрока.Количество = СтрокаДанных.Количество;
				Иначе
					НайденнаяСтрока.Количество = НайденнаяСтрока.Количество + СтрокаДанных.Количество;
				КонецЕсли;
				
			КонецЕсли;
		КонецЦикла;
		
		ОбъектПортфеля.Записать();
		Возврат Истина;
		
	Исключение
		Сообщить("Ошибка при загрузке: " + ОписаниеОшибки());
		Возврат Ложь;
	КонецПопытки;
	
КонецФункции

#КонецОбласти

// Реквизиты формы:
// ИмяФайла - Строка
// Портфель - СправочникСсылка.УП_Портфели
// РежимЗагрузки - Строка (с выбором из списка: "Заменить", "Дополнить")
// ТекстИнформации - Строка
// ТаблицаДанных - ТаблицаЗначений с колонками:
//   - Наименование (Строка)
//   - Тикер (Строка)
//   - Количество (Число)
//   - Инструмент (СправочникСсылка.УП_БиржевыеИнструменты)
//   - Статус (Строка)
